app/controllers/auction_controller.rb

  def create
    @item = Item.find_or_create_by_name(params[:item].downcase)
    auction = Auction.new
    auction.item = @item
    if params[:price].include?('k')
      params[:price] = params[:price].to_f * 1000
    end
    auction.price = params[:price].to_i
    auction.time = Time.parse params[:time]
    if auction.save
---
INSERT INTO "items" ("name", "created_at", "updated_at") VALUES('flowing black robe', '2010-05-18 22:21:23', '2010-05-18 22:21:23')
SELECT * FROM "items" WHERE ("items"."name" = 'flowing black robe') LIMIT 1
INSERT INTO "auctions" ("price", "created_at", "updated_at", "time", "item_id") VALUES(9.0, '2010-05-18 22:22:00', '2010-05-18 22:22:00', '2010-05-18 22:19:31', 1)