app/controllers/auction_controller.rb

  def index
    @search = ''
    unless params.include?(:letter)
      params[:letter] = 'a'
    end
    @letter = params[:letter]
    @items = Item.name_starts_with(params[:letter]).order('name ASC').include(:auctions).not_hidden
---
SELECT "auctions".* FROM "auctions" WHERE ("auctions".item_id IN (1,10,2,3,4,5,6,7,8,9))
SELECT * FROM "items" WHERE (lower(name) like 'a%') ORDER BY name ASC

  def search
    @search = params[:search][:search]
    @items = Item.search_for(params[:search][:search].downcase).order('name ASC').include(:auctions).not_hidden
---
SELECT * FROM "items" WHERE (lower(name) LIKE '%fbss%') ORDER BY name ASC